Revit 2024 API
Panel.Transform Property
This property is used to find the transform of a curtain panel within project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public Transform Transform { get; }
Visual Basic
Public ReadOnly Property Transform As Transform
	Get
Visual C++
public:
property Transform^ Transform {
	Transform^ get ();
}
Remarks
The Transform property returns a Autodesk::Revit::DB::Transform object that can be used to find the transfer matrix of a curtain panel within the project.
See Also
Panel Class
Autodesk.Revit.DB Namespace